Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ОстаткиРыб.Записывать = Истина;
	
		Запрос = Новый Запрос;
		Запрос.Текст = 			"ВЫБРАТЬ			|	ОстаткиРыбОстатки.ПородаРыб КАК ПородаРыб,			|	ОстаткиРыбОстатки.КоличествоОстаток КАК Количество			|ИЗ			|	РегистрНакопления.ОстаткиРыб.Остатки(&Период, Аквариум = &ВыбранныйАквариум) КАК ОстаткиРыбОстатки";	
		
		Запрос.УстановитьПараметр("Период", МоментВремени());		Запрос.УстановитьПараметр("ВыбранныйАквариум", Аквариум);    
		
		РезультатЗапроса = Запрос.Выполнить(); 
		
		Если РезультатЗапроса.Пустой() Тогда			Сообщить("В выбранном аквариуме нет рыб");			Отказ = Истина;			Возврат;		КонецЕсли;
	
		ВсегоРыбВАквариуме = 0;		
		ПодсчетКоличества = РезультатЗапроса.Выбрать();  
		
		Пока ПодсчетКоличества.Следующий() Цикл			ВсегоРыбВАквариуме = ВсегоРыбВАквариуме + ПодсчетКоличества.Количество;		КонецЦикла;			Если ВсегоРыбВАквариуме = 0 Тогда			Сообщить("Количество рыб равно нулю. Проведение невозможно.");			Отказ = Истина;			Возврат;		КонецЕсли;    
	
		СтоимостьНаОднуРыбу = СтоимостьКорма / ВсегоРыбВАквариуме;  
		
		РаспределениеСтоимости = РезультатЗапроса.Выбрать();   
				Пока РаспределениеСтоимости.Следующий() Цикл
			ДоляСтоимостиПороды = РаспределениеСтоимости.Количество * СтоимостьНаОднуРыбу;  
		
			НовоеДвижение = Движения.ОстаткиРыб.Добавить(); 			НовоеДвижение.ВидДвижения = ВидДвиженияНакопления.Приход;

			НовоеДвижение.Период = Дата;			НовоеДвижение.Аквариум = Аквариум;			НовоеДвижение.ПородаРыб = РаспределениеСтоимости.ПородаРыб; 
			
			НовоеДвижение.Количество = 0;
			НовоеДвижение.Сумма = ДоляСтоимостиПороды;
		КонецЦикла;    
		
КонецПроцедуры
		