
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиРыб Приход
	Движения.ОстаткиРыб.Записывать = Истина;
	Для Каждого ТекСтрокаРыбы Из Рыбы Цикл
		Движение = Движения.ОстаткиРыб.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Аквариум = ТекСтрокаРыбы.Аквариум;
		Движение.ПородаРыб = ТекСтрокаРыбы.ПородаРыб;
		Движение.Количество = ТекСтрокаРыбы.Количество;
		Движение.Сумма = ТекСтрокаРыбы.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
